app/controllers/comedies_controller.rb

  def show
    @comedy          = Comedy.find(params[:id])
---
SELECT  "comedies".* FROM "comedies" WHERE (id < 51) ORDER BY "comedies"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def index
    @comedies = Comedy.all.includes(:image).order(created_at: :desc).page(params[:page]).per(5)

    respond_to do |format|
      format.html do |html|
        html.desktop do
          @comedies = @comedies.includes(:tags)
---
SELECT  "comedies".* FROM "comedies" ORDER BY "comedies"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comedies"
SELECT  "comedies".* FROM "comedies" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 5]]
SELECT  "images".* FROM "images" WHERE "images"."comedy_id" IS NULL ORDER BY "images"."id" DESC LIMIT ?  [["LIMIT", 1]]