app/controllers/comedies_controller.rb

SELECT  "comedies".* FROM "comedies" WHERE "comedies"."publish" = ? ORDER BY "comedies"."published_at" DESC LIMIT ? OFFSET ?  [["publish", true], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comedies" WHERE "comedies"."publish" = ?  [["publish", true]]
---
  def index
    @comedies = Comedy.publicable.order(published_at: :desc).page(params[:page]).per(5)