app/views/comedies/_comedy.html.erb

SELECT  "images".* FROM "images" WHERE "images"."comedy_id" IS NULL ORDER BY "images"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  <div class="entry-body">
    <% if comedy.image.present? && comedy.image.image_url.present? %>